//Cracked by Roath
#include <room.h>
inherit HOCKSHOP;

void create ()
{
  set ("short", "ÃÜÁÖµ±ÆÌ");
  set ("long", @LONG

ÕâÊÇÃÜÁÖµØÇøÎ¨Ò»µÄÒ»¼Òµ±ÆÌÁË¡£ËØÀ´ÒÔÂòÂô¹«Æ½×Å³Æ¡£ÃÅ¿Ú¹ÒÁËÒ»
¿éÅÆ×Ó (paizi)¡£¸ßÀÏ°åÊÇ¸öºÜ¾«Ã÷µÄÉúÒâÈË£¬¼ûÄã×ßÁË½øÀ´£¬ºÜ¿Í
ÆøµØºÍÄãº®êÑ£¬µ«ÑÛ¾¦ÀïÈ´Ã»ÓĞÊ²Ã´Ğ¦Òâ£¬ºÜÉóÉ÷µØ´òÁ¿×ÅÄã¡£
LONG);

  set("exits", ([ /* sizeof() == 1 */
"north" : "/u/calvin/room/ÃÜÁÖÉî´¦5",
]));
  set("item_desc", ([ /* sizeof() == 1 */
  "paizi" : "
±¾µ±ÆÌ²ÆÁ¦ĞÛºñ£¬Í¯ÛÅÎŞÆÛ£¬»¶Ó­»İ¹Ë£¬¾ø¶Ô±£ÃÜ¡£
¿Í¹Ù¿ÉÒÔÔÚÕâÀï£º
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %  µäµ±(pawn)              %
    %  Âô¶Ï(sell)              %
    %  ¹À¼Û(value)             %
    %  Êê»Ø(retrieve stamp)    %
    %  ¹ºÂò(buy) ÓÃlist²é¿´ ¡  %
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%
¸÷ÖÖ»õÎï£¬Í­Ç®¡¢ÒøÁ½¡¢»Æ½ğ¡¢ÒøÆ±¡¢×êÊ¯Ò»¸ÅÍ¨ÓÃ¡£

"]));
  set("objects", ([ /* sizeof() == 1 */
  "/u/calvin/npc/ÃÜÁÖµ±ÆÌÀÏ°å" : 1,
]));
  set("no_clean_up", 1);

  setup();
}
int clean_up()
{
      return 0;
}
